import tensorflow as tf
import pandas as pd

inputfile1='API.xlsx'
inputfile2=''
data = pd.read_excel(inputfile1,index='Date',sheet_name=0)
data_train_feature = data.loc[0:780,['智能识别','产业经济','电子商务','商品信息','短信API','企业综合','企业工商','银行卡核验','车辆信息','智能风控','天气查询','经营管理'
          ,'身份核验','知识产权','app应用','快递查询','舆情监测','IP地址','手机号验证','海关进出口','智能客服','1分钱','司法','银行卡信息',
          '交通违章','资质备案','行政监管','位置地图','招投标','公告文书','投融资','黑名单','风控','手机号码归属','反欺诈','星座运势','手机号码状态',
           '航空航班','新闻资讯','环境质量','尾号限行','行驶驾驶','税务信息','信用评估','基站','自然灾害','万年历','手机在网时长','企业图谱','智能营销',
           '油价查询','彩票信息','公路铁路','京东E卡','市场调研','借贷','智能支付','区号查询','用户画像','股票汇率','视频会员']]


mean = data_train_feature.mean(axis=0)
std = data_train_feature.std(axis=0)

data_input=pd.read_excel(inputfile2,index='Date',sheet_name=0)

data_predict=data_input.loc[:,['智能识别','产业经济','电子商务','商品信息','短信API','企业综合','企业工商','银行卡核验','车辆信息','智能风控','天气查询','经营管理'
          ,'身份核验','知识产权','app应用','快递查询','舆情监测','IP地址','手机号验证','海关进出口','智能客服','1分钱','司法','银行卡信息',
          '交通违章','资质备案','行政监管','位置地图','招投标','公告文书','投融资','黑名单','风控','手机号码归属','反欺诈','星座运势','手机号码状态',
           '航空航班','新闻资讯','环境质量','尾号限行','行驶驾驶','税务信息','信用评估','基站','自然灾害','万年历','手机在网时长','企业图谱','智能营销',
           '油价查询','彩票信息','公路铁路','京东E卡','市场调研','借贷','智能支付','区号查询','用户画像','股票汇率','视频会员']]

data_predict=(data_predict-mean)/std

model=tf.keras.models.load_model('API.h5')

result=model.predict()